# ContinuousrailEndTerminationAttachmentParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousrailEndTerminationAttachmentParam Property
ParameterTypeId Class See Also
---
"Extension Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailEndTerminationAttachmentParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailEndTerminationAttachmentParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailEndTerminationAttachmentParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace